docuSign/tmp/RequestSenderToken.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.docusign.net/API/3.0" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><SOAP-ENV:Header><wsa:Action>http://www.docusign.net/API/3.0/RequestSenderToken</wsa:Action><wsa:To>https://demo.docusign.net/api/3.0/api.asmx</wsa:To><wsa:MessageID>uudi:f20ad4a2-795d-ca62-981a-abff1070b13c</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Created>2010-11-22T21:07:00Z</wsu:Created><wsu:Expires>2010-11-22T21:12:00Z</wsu:Expires></wsu:Timestamp><wsse:UsernameToken><wsse:Username>[TREE-b88ac21a-a6be-4bde-b342-c38933721a1e]397fae8a-af31-45e2-bc03-3db45039f255</wsse:Username><wsse:Password>Doc-4tron</wsse:Password><wsse:Nonce>7AfQzvWCZa3A1X+3NIfHNLmhZOw5q/4pGay/sUMtTcw=</wsse:Nonce><wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2010-11-22T21:07:00Z</wsu:Created></wsse:UsernameToken></wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body><ns1:RequestSenderToken><ns1:EnvelopeID>cfc0dee9-3825-4f40-81b5-1882d0e1b4d3</ns1:EnvelopeID><ns1:AccountID>40bedf24-70fd-4234-bf57-4263fa036605</ns1:AccountID><ns1:ReturnURL>https://localhost:443/docuSign/docuSignStatus.php</ns1:ReturnURL></ns1:RequestSenderToken></SOAP-ENV:Body></SOAP-ENV:Envelope>
